## Plan Result (prod-app-registrations)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-00-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/ss-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptlsbox-00-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-stg-00-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-dev-01-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ithc-00-aks&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS SDS AKS version checker-Reader-/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-test-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-prod-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/ss-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptlsbox-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/ss-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptlsbox-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-stg-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-stg-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-dev-01-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-dev-01-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ithc-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ithc-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS SDS AKS version checker-Reader-/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Target":"prod-app-registrations","Vars":{}} -->